
    Ed  (C) 2011  Jure Žiberna
    This program comes with ABSOLUTELY NO WARRANTY.
    This is free software, and you are welcome to redistribute it
    under the terms of the GNU General Public License, version 3 or later.


Help message
============
usage: ed [-h] [--conf [CONFIG_PATH]] FILE [TOOL]

Ed  (C) 2011  Jure Žiberna

positional arguments:
  FILE                  file to edit
  TOOL                  tool to use

optional arguments:
  -h, --help            show this help message and exit
  --conf [CONFIG_PATH]  path to configuration file


Configuration sample
====================
# a comment
[TOOLS]
vim
nano # another comment
geany
somevar=sometool -arg1 --arg2

[PATHS]
HOME=/home/myname

[FILES]
httpd=/etc/httpd/conf/httpd.conf
i3=$HOME/.i3/config with nano -x
xinit=$HOME/.xinitrc with $somevar


Sample of usage
===============
[jure@Kant ~]$ ed httpd nonexistent
> Error running nonexistent /etc/httpd/conf/httpd.conf:
No such file or directory: 'nonexistent'
[jure@Kant ~]$ ed httpd
> Edited /etc/httpd/conf/httpd.conf with vim.
[jure@Kant ~]$ ed httpd ask
   1) vim
   2) nano
   3) geany
> Choose tool or type a command (default=1): 3
> Edited /etc/httpd/conf/httpd.conf with geany.
[jure@Kant ~]$ ed httpd ask
   1) vim
   2) nano
   3) geany
> Choose tool or type a command (default=1): nano -x
> Edited /etc/httpd/conf/httpd.conf with nano -x.
[jure@Kant ~]$ ed httpd "vim -e"
> Edited /etc/httpd/conf/httpd.conf with vim -e.
[jure@Kant ~]$

* It may seem confusing, but before ed says "Edited x with y.", it actually
  opens file x with command y. The message is shown after you have closed the
  tool, tool being an editor with graphical or command-line user interface, or
  any command you wish to pass the file path to.

Tips
====
1. To hardcode path to configuration file, pass the path to main function in
   bin/ed. This is useful for running ed as root with configuration
   file in your home folder.
